11/data/attachments/3fd0fed7d8e126f9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Leonard_finally_Friend_16035_2</nif:username>
            <nif:friendToBeRequested>soap_friends_d9d3eed9-e509-469f-aa10-3f2a6f815ba9</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>